## groupby() 와 agg()

#### DataFrame.groupby(기준항목).agg(사용하고자 하는 function들)

In [1]:
import warnings
warnings.filterwarnings(action='ignore') 

import pandas as pd
import numpy as np
import csv
import folium
import matplotlib.pyplot as plt
plt.rc('font',family='D2CodingLigature Nerd Font')

In [2]:
# pandas에서 csv파일 읽어오기

exam = pd.read_csv('../../data/exam.csv')
exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [4]:
exam.groupby('nclass')[['math', 'english']].mean()

         math  english
nclass
1       46.25    94.75
2       61.25    84.25
3       45.00    86.50
4       56.75    84.75
5       78.00    74.25

In [5]:
exam.groupby('nclass').mean()

          id   math  english  science
nclass
1        2.5  46.25    94.75    61.50
2        6.5  61.25    84.25    58.25
3       10.5  45.00    86.50    39.25
4       14.5  56.75    84.75    55.00
5       18.5  78.00    74.25    83.25

In [6]:
exam.groupby('nclass').agg(mean_math = ('math', 'mean'), mean_english = ('english', 'mean'))

        mean_math  mean_english
nclass
1           46.25         94.75
2           61.25         84.25
3           45.00         86.50
4           56.75         84.75
5           78.00         74.25

In [7]:
exam.groupby('nclass').agg(mean_math = ('math', 'mean'), 
                           sum_english = ('english', 'sum'),
                           median_math = ('math', 'median'), 
                           n = ('nclass','count')
                          )

        mean_math  sum_english  median_math  n
nclass
1           46.25          379         47.5  4
2           61.25          337         65.0  4
3           45.00          346         47.5  4
4           56.75          339         53.0  4
5           78.00          297         79.0  4